---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SystemsFailures.PastePartsWithInvalidService
source: html/4a702bcd-4082-2064-bf72-a81aae4e2f5a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SystemsFailures.PastePartsWithInvalidService Property

Parts were not pasted because fabrication configuration is not available or service is not valid in the type properties for the system.

## Syntax (C#)
```csharp
public static FailureDefinitionId PastePartsWithInvalidService { get; }
```